# 数据清洗与准备

In [1]:
import pandas as pd
import numpy as np

## 处理缺失值

In [2]:
string_data = pd.Series(['aardvark','articoke',np.nan,'avocado'])

In [3]:
string_data

0    aardvark
1    articoke
2         NaN
3     avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

- 过滤缺失值

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1,NA,3.5,NA,7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned = data.dropna()

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7,3))

In [21]:
df

          0         1         2
0 -1.010783 -0.560966 -0.489491
1  0.623777 -0.031453  0.563079
2 -0.302185  0.957709 -0.760597
3  1.240145 -0.878587 -1.609851
4 -1.200825  0.541046 -1.313676
5 -0.121899  0.121824  1.087897
6 -1.570380 -0.762484 -0.172850

In [22]:
df.iloc[:4,1]= NA

In [23]:
df.iloc[:2,2] = NA

In [25]:
df

          0         1         2
0 -1.010783       NaN       NaN
1  0.623777       NaN       NaN
2 -0.302185       NaN -0.760597
3  1.240145       NaN -1.609851
4 -1.200825  0.541046 -1.313676
5 -0.121899  0.121824  1.087897
6 -1.570380 -0.762484 -0.172850

In [26]:
df.dropna()

          0         1         2
4 -1.200825  0.541046 -1.313676
5 -0.121899  0.121824  1.087897
6 -1.570380 -0.762484 -0.172850

In [27]:
df.dropna(thresh=2) # thresh表示某行至少有几个非缺失值

          0         1         2
2 -0.302185       NaN -0.760597
3  1.240145       NaN -1.609851
4 -1.200825  0.541046 -1.313676
5 -0.121899  0.121824  1.087897
6 -1.570380 -0.762484 -0.172850

In [30]:
df.dropna(thresh=1)

          0         1         2
0 -1.010783       NaN       NaN
1  0.623777       NaN       NaN
2 -0.302185       NaN -0.760597
3  1.240145       NaN -1.609851
4 -1.200825  0.541046 -1.313676
5 -0.121899  0.121824  1.087897
6 -1.570380 -0.762484 -0.172850

- 补全缺失值

In [31]:
df.fillna(0)

          0         1         2
0 -1.010783  0.000000  0.000000
1  0.623777  0.000000  0.000000
2 -0.302185  0.000000 -0.760597
3  1.240145  0.000000 -1.609851
4 -1.200825  0.541046 -1.313676
5 -0.121899  0.121824  1.087897
6 -1.570380 -0.762484 -0.172850

In [32]:
df.fillna({1:0.5,2:0}) # 为不同列设定不同的填充值

          0         1         2
0 -1.010783  0.500000  0.000000
1  0.623777  0.500000  0.000000
2 -0.302185  0.500000 -0.760597
3  1.240145  0.500000 -1.609851
4 -1.200825  0.541046 -1.313676
5 -0.121899  0.121824  1.087897
6 -1.570380 -0.762484 -0.172850

In [34]:
df.fillna(0,inplace=True)

In [35]:
df

          0         1         2
0 -1.010783  0.000000  0.000000
1  0.623777  0.000000  0.000000
2 -0.302185  0.000000 -0.760597
3  1.240145  0.000000 -1.609851
4 -1.200825  0.541046 -1.313676
5 -0.121899  0.121824  1.087897
6 -1.570380 -0.762484 -0.172850

In [37]:
df = pd.DataFrame(np.random.randn(6,3))

In [38]:
df.iloc[2:,1] = NA

In [39]:
df.iloc[4:,2] = NA

In [40]:
df

          0         1         2
0  1.242539  0.515497 -0.665912
1 -0.024792  1.181812 -1.299980
2 -1.123594       NaN -0.066079
3 -1.045543       NaN  1.614266
4  0.387067       NaN       NaN
5 -0.201697       NaN       NaN

In [41]:
df.fillna(method='ffill')

          0         1         2
0  1.242539  0.515497 -0.665912
1 -0.024792  1.181812 -1.299980
2 -1.123594  1.181812 -0.066079
3 -1.045543  1.181812  1.614266
4  0.387067  1.181812  1.614266
5 -0.201697  1.181812  1.614266

In [42]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  1.242539  0.515497 -0.665912
1 -0.024792  1.181812 -1.299980
2 -1.123594  1.181812 -0.066079
3 -1.045543  1.181812  1.614266
4  0.387067       NaN  1.614266
5 -0.201697       NaN  1.614266

In [43]:
data = pd.Series([1.,NA,3.5,NA,7])

In [44]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 数据转换

- 删除重复值

In [48]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],
            'k2':[1,1,2,3,3,4,4]})

In [49]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [50]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [51]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [52]:
data['v1'] = range(7)

In [53]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [54]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [56]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

- 使用函数或映射进行数据转换

In [65]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','pastrami','corned beef','bacon','pastrami','honey ham','nova lox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [66]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [72]:
meat_to_animal = {'bacon':'pig',
                 'pulled pork':'pig',
                 'pastrami':'cow',
                  'corned beef':'cow',
                 'honey ham':'pig',
                 'nova lox':'salmon'}

In [69]:
lowercased = data['food'].str.lower()

In [73]:
data['animal'] = lowercased.map(meat_to_animal)

In [74]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [78]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

- 替代值

In [79]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [80]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [82]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [83]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [84]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [86]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

- 重命名轴索引

In [88]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=['ohio','colorado','new york'],
                   columns=['one','two','three','four'])

In [89]:
transform = lambda x:x[:4].upper()

In [93]:
data.index = data.index.map(transform)

In [94]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [97]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [99]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [100]:
data.rename(index={'OHIO':'INDIANA'},
           inplace=True)

In [101]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

- 离散化和分箱

In [102]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [103]:
bins = [18,25,35,60,100]

In [104]:
cats = pd.cut(ages,bins)

In [105]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [106]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [107]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [108]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [109]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [110]:
group_names = ['youth','youthadult','middleaged','senior']

In [111]:
pd.cut(ages,bins,labels=group_names)

[youth, youth, youth, youthadult, youth, ..., youthadult, senior, middleaged, middleaged, youthadult]
Length: 12
Categories (4, object): [youth < youthadult < middleaged < senior]

In [113]:
data = np.random.rand(20)

In [115]:
pd.cut(data,4,precision=2)

[(0.49, 0.72], (0.49, 0.72], (0.72, 0.95], (0.72, 0.95], (0.49, 0.72], ..., (0.019, 0.25], (0.25, 0.49], (0.019, 0.25], (0.72, 0.95], (0.019, 0.25]]
Length: 20
Categories (4, interval[float64]): [(0.019, 0.25] < (0.25, 0.49] < (0.49, 0.72] < (0.72, 0.95]]

In [116]:
data = np.random.randn(1000)

In [117]:
cats =pd.cut(data,4)

In [118]:
cats

[(0.192, 1.725], (0.192, 1.725], (0.192, 1.725], (0.192, 1.725], (-2.88, -1.341], ..., (0.192, 1.725], (0.192, 1.725], (0.192, 1.725], (0.192, 1.725], (-1.341, 0.192]]
Length: 1000
Categories (4, interval[float64]): [(-2.88, -1.341] < (-1.341, 0.192] < (0.192, 1.725] < (1.725, 3.258]]

In [119]:
pd.value_counts(cats)

(-1.341, 0.192]    494
(0.192, 1.725]     385
(-2.88, -1.341]     93
(1.725, 3.258]      28
dtype: int64

In [120]:
pd.qcut(data,[0,0.1,0.5,0.9,1])

[(-0.0509, 1.264], (-0.0509, 1.264], (-0.0509, 1.264], (-0.0509, 1.264], (-2.875, -1.299], ..., (-0.0509, 1.264], (-0.0509, 1.264], (-0.0509, 1.264], (-0.0509, 1.264], (-1.299, -0.0509]]
Length: 1000
Categories (4, interval[float64]): [(-2.875, -1.299] < (-1.299, -0.0509] < (-0.0509, 1.264] < (1.264, 3.258]]

- 检测和过滤异常值

In [121]:
data = pd.DataFrame(np.random.randn(1000,4))

In [122]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.044978     0.030142     0.053685     0.074039
std       0.967365     1.012792     1.000359     1.005004
min      -3.393912    -3.846001    -4.016182    -2.826773
25%      -0.693260    -0.662116    -0.632568    -0.611980
50%      -0.035042     0.022923     0.090833     0.041980
75%       0.588204     0.757111     0.744583     0.705042
max       2.767966     2.945490     3.340465     3.322107

In [123]:
col= data[2]

In [125]:
col[np.abs(col)>3]

463    3.340465
475   -4.016182
Name: 2, dtype: float64

In [126]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
50  -3.225234 -0.361774 -0.112253  0.962058
146  0.420674 -3.846001 -0.041401 -0.606906
463  0.219466 -1.533361  3.340465  1.629258
475  0.996705  1.284411 -4.016182  1.208219
500  1.332230 -0.150339  0.136514  3.322107
557  0.269510  1.564492 -0.384954  3.091789
611 -0.378002 -3.217884 -1.248132 -1.176071
862 -0.526237  1.084044  0.059086  3.022042
937 -3.393912 -0.555428 -1.515035 -0.675928

In [127]:
data[np.abs(data)>3] = np.sign(data)*3

In [128]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.044359     0.031206     0.054360     0.073603
std       0.965363     1.009222     0.995665     1.003677
min      -3.000000    -3.000000    -3.000000    -2.826773
25%      -0.693260    -0.662116    -0.632568    -0.611980
50%      -0.035042     0.022923     0.090833     0.041980
75%       0.588204     0.757111     0.744583     0.705042
max       2.767966     2.945490     3.000000     3.000000

In [129]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2 -1.0  1.0 -1.0  1.0
3 -1.0  1.0 -1.0  1.0
4  1.0 -1.0 -1.0  1.0

- 置换和随机抽样

In [130]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [131]:
sampler = np.random.permutation(5)

In [132]:
sampler

array([2, 3, 1, 0, 4])

In [133]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [134]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19

In [135]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

In [136]:
choice = pd.Series([5,7,-1,6,4])

In [137]:
draws = choice.sample(n=10,replace=True)

In [138]:
draws

3    6
1    7
2   -1
0    5
3    6
1    7
0    5
0    5
4    4
4    4
dtype: int64

- 计算指标/虚拟变量

In [141]:
df = pd.DataFrame({'key':list('bbacab'),
                  'data1':range(6)})

In [142]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [143]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [145]:
dummies = pd.get_dummies(df['key'],prefix='key')

In [146]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [147]:
df_with_dummy = df[['data1']].join(dummies)

In [148]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## 字符串操作

- 字符串对象方法

In [149]:
val = 'a,b, guido'

In [150]:
val.split(',')

['a', 'b', ' guido']

In [151]:
pieces =  [x.strip() for x in val.split(',')]

In [152]:
pieces

['a', 'b', 'guido']

In [153]:
first,second,third = pieces

In [155]:
first + '::' + second + '::' + third

'a::b::guido'

In [156]:
'guido' in val

True

In [157]:
val.index(',')

1

In [158]:
val.find(':')

-1

In [159]:
val.index(':')

ValueError: substring not found

In [160]:
val.count(',')

2

In [161]:
val.replace(',','::')

'a::b:: guido'

In [162]:
val.replace(',','')

'ab guido'

- 正则表达式

In [163]:
import re

In [164]:
text =  "foo   bar\t baz  \tqux"

In [165]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [167]:
regex = re.compile('\s+')

In [168]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [169]:
regex.findall(text)

['   ', '\t ', '  \t']

In [170]:
text = """Dave dave@googgle.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryanryan@yahoo.com
"""

In [171]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [172]:
regex =re.compile(pattern,flags=re.IGNORECASE)

In [173]:
regex.findall(text)

['dave@googgle.com', 'steve@gmail.com', 'rob@gmail.com', 'Ryanryan@yahoo.com']

In [174]:
m = regex.search(text)

In [175]:
m

In [176]:
text[m.start():m.end()]

'dave@googgle.com'

In [177]:
print(regex.match(text))

None

In [179]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
REDACTED

In [180]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [181]:
regex = re.compile(pattern,flags=re.IGNORECASE)

In [182]:
m = regex.match('wesm@bright.net')

In [184]:
m.groups()

('wesm', 'bright', 'net')

In [185]:
regex.findall(text)

[('dave', 'googgle', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('Ryanryan', 'yahoo', 'com')]

In [187]:
print(regex.sub(r'Username:\1,Domain:\2,Suffix:\3',text))

Dave Username:dave,Domain:googgle,Suffix:com
Steve Username:steve,Domain:gmail,Suffix:com
Rob Username:rob,Domain:gmail,Suffix:com
Username:Ryanryan,Domain:yahoo,Suffix:com

-  pandas中的向量化字符串函数

In [188]:
data = {'Dave':'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}

In [189]:
data = pd.Series(data)

In [190]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [191]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [192]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [193]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [196]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [197]:
matches =  data.str.match(pattern,flags=re.IGNORECASE)

In [198]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [199]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [201]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [202]:
matches.dtype

dtype('O')

# 数据规整：连接、联合与重塑

In [1]:
import pandas as pd
import numpy as np

## 分层索引

In [205]:
data = pd.Series(np.random.randn(9),
                index=[list('aaabbccdd'),
                [1,2,3,1,3,1,2,2,3]])

In [206]:
data

a  1   -0.563920
   2   -0.398935
   3   -1.605332
b  1    0.431134
   3   -0.344098
c  1   -0.142014
   2   -0.521472
d  2   -0.445030
   3   -1.456320
dtype: float64

In [207]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [208]:
data['b']

1    0.431134
3   -0.344098
dtype: float64

In [209]:
data['b':'c']

b  1    0.431134
   3   -0.344098
c  1   -0.142014
   2   -0.521472
dtype: float64

In [210]:
data.loc[['b','d']]

b  1    0.431134
   3   -0.344098
d  2   -0.445030
   3   -1.456320
dtype: float64

In [211]:
data.loc[:,2]

a   -0.398935
c   -0.521472
d   -0.445030
dtype: float64

In [212]:
data.unstack()

          1         2         3
a -0.563920 -0.398935 -1.605332
b  0.431134       NaN -0.344098
c -0.142014 -0.521472       NaN
d       NaN -0.445030 -1.456320

In [213]:
data.unstack().stack()

a  1   -0.563920
   2   -0.398935
   3   -1.605332
b  1    0.431134
   3   -0.344098
c  1   -0.142014
   2   -0.521472
d  2   -0.445030
   3   -1.456320
dtype: float64

In [215]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['ohio','ohio','colorado'],
                           ['green','red','green']])

In [216]:
frame

     ohio     colorado
    green red    green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [217]:
frame.index.names = ['key1','key2']

In [218]:
frame.columns.names = ['state','color']

In [219]:
frame

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [220]:
frame['ohio']

color      green  red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

- 重排序和层级排序

In [221]:
frame.swaplevel('key1','key2')

state      ohio     colorado
color     green red    green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [222]:
frame.sort_index(level =1)

state      ohio     colorado
color     green red    green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

- 按层级进行汇总统计

In [224]:
frame.sum(level='key2')

state  ohio     colorado
color green red    green
key2
1         6   8       10
2        12  14       16

In [225]:
frame.sum(level='color',axis=1)

color      green  red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

- 使用DataFrame的列进行索引

In [226]:
frame = pd.DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [227]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [228]:
frame2 = frame.set_index(['c','d'])

In [230]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [233]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [234]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 联合与合并数据集

- 数据库风格的DataFrame连接

In [2]:
df1 = pd.DataFrame({'key':list('bbacaab'),
                   'data1':range(7)})

In [3]:
df2 = pd.DataFrame({'key':['a','b','d'],
                   'data2':range(3)})

In [4]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [5]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [6]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [8]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [9]:
df3 = pd.DataFrame({'lkey':list('bbacaab'),
                   'data1':range(7)})

In [10]:
df4 = pd.DataFrame({'rkey':['a','b','d'],
                   'data2':range(3)})

In [11]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [13]:
pd.merge(df1,df2,how = 'outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [14]:
df1  = pd.DataFrame({'key':list('bbacab'),
                    'data1':range(6)})

In [15]:
df2  = pd.DataFrame({'key':list('ababd'),
                     'data2':range(5)})

In [16]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [17]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [18]:
pd.merge(df1,df2,on='key',how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [19]:
pd.merge(df1,df2,how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [20]:
left = pd.DataFrame({'key1':['foo','foo','bar'],
                    'key2':['one','two','one'],
                    'lval':[1,2,3]})

In [21]:
right = pd.DataFrame({'key1':['foo','foo','bar','bar'],
                     'key2':['one','one','one','two'],
                     'rval':[4,5,6,7]})

In [22]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [23]:
pd.merge(left,right,on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [24]:
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

- 根据索引合并

In [25]:
left1 = pd.DataFrame({'key1':list('abaabc'),
                     'value':range(6)})

In [26]:
right1 = pd.DataFrame({'group_val':[3.5,7]},index=['a','b'])

In [27]:
left1

  key1  value
0    a      0
1    b      1
2    a      2
3    a      3
4    b      4
5    c      5

In [28]:
right1

   group_val
a        3.5
b        7.0

In [30]:
pd.merge(left1,right1,left_on='key1',right_index=True)

  key1  value  group_val
0    a      0        3.5
2    a      2        3.5
3    a      3        3.5
1    b      1        7.0
4    b      4        7.0

In [31]:
pd.merge(left1,right1,left_on='key1',right_index=True,how='outer')

  key1  value  group_val
0    a      0        3.5
2    a      2        3.5
3    a      3        3.5
1    b      1        7.0
4    b      4        7.0
5    c      5        NaN

In [32]:
lefth = pd.DataFrame({'key1':['ohio','ohio','ohio','nevada','nevada'],
                     'key2':[2000,2001,2002,2001,2002],
                     'data':np.arange(5.)})

In [33]:
righth = pd.DataFrame(np.arange(12).reshape((6,2)),index=[['nevada','nevada','ohio','ohio','ohio','ohio'],[2001,2000,2000,2000,2001,2002]],
                     columns=['event1','event2'])

In [34]:
lefth

     key1  key2  data
0    ohio  2000   0.0
1    ohio  2001   1.0
2    ohio  2002   2.0
3  nevada  2001   3.0
4  nevada  2002   4.0

In [35]:
righth

             event1  event2
nevada 2001       0       1
       2000       2       3
ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [36]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

     key1  key2  data  event1  event2
0    ohio  2000   0.0       4       5
0    ohio  2000   0.0       6       7
1    ohio  2001   1.0       8       9
2    ohio  2002   2.0      10      11
3  nevada  2001   3.0       0       1

In [37]:
left2 = pd.DataFrame([[1.,2.],[3.,4.],[5.,6.]],
                    index=['a','c','e'],
                    columns=['ohio','nevada'])

In [39]:
right2 = pd.DataFrame([[7.,8.],[9.,10],[11.,12],[13.,14]],
                     index = ['b','c','d','e'],
                     columns = ['Missouri','Alabama'])

In [40]:
left2

   ohio  nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [41]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [42]:
pd.merge(left2,right2,how='outer',left_index=True,right_index=True)

   ohio  nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [43]:
left2.join(right2,how='outer')

   ohio  nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [45]:
left1.join(right1,on='key1')

  key1  value  group_val
0    a      0        3.5
1    b      1        7.0
2    a      2        3.5
3    a      3        3.5
4    b      4        7.0
5    c      5        NaN

In [46]:
another = pd.DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],
                      index=['a','c','e','f'],
                      columns=['new york','oregon'])

In [47]:
another

   new york  oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [50]:
left2.join([right2,another],how = 'outer',sort=True)

   ohio  nevada  Missouri  Alabama  new york  oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

In [51]:
left2.join([right2,another])

   ohio  nevada  Missouri  Alabama  new york  oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

- 沿轴向连接

In [52]:
arr = np.arange(12).reshape((3,4))

In [53]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [54]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [55]:
s1 = pd.Series([0,1],index=['a','b'])

In [56]:
s2 = pd.Series([2,3,4],index=['c','d','e'])

In [57]:
s3 = pd.Series([5,6],index=['f','g'])

In [58]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [60]:
pd.concat([s1,s2,s3],axis=1,sort=True)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [61]:
s4 = pd.concat([s1,s2])

In [62]:
s4

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [65]:
pd.concat([s1,s4],axis=1,sort=True)

     0  1
a  0.0  0
b  1.0  1
c  NaN  2
d  NaN  3
e  NaN  4

In [67]:
pd.concat([s1,s4],axis=1,join='inner')

   0  1
a  0  0
b  1  1

In [68]:
pd.concat([s1,s4],axis=1,join_axes=[['a','c','b','e']])

     0  1
a  0.0  0
c  NaN  2
b  1.0  1
e  NaN  4

In [69]:
result = pd.concat([s1,s2,s3],keys=['one','two','three'])

In [71]:
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [72]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [74]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'],sort = True)

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [75]:
df1 = pd.DataFrame(np.arange(6).reshape((3,2)),index=['a','b','c'],columns=['one','two'])

In [76]:
df2 = pd.DataFrame(5+np.arange(4).reshape((2,2)),index=['a','c'],columns=['three','four'])

In [77]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [78]:
df2

   three  four
a      5     6
c      7     8

In [80]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],sort=True)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [81]:
df1 = pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])

In [82]:
d2 = pd.DataFrame(np.random.randn(2,3),columns=['b','d','a'])

In [83]:
df1

          a         b         c         d
0  1.723214  0.036265 -0.223240  0.253834
1  0.013932  1.429481  0.654138 -1.471901
2  0.118656 -1.155233  0.091064  1.604110

In [84]:
df2

   three  four
a      5     6
c      7     8

In [86]:
pd.concat([df1,df2],ignore_index=True,sort=True)

          a         b         c         d  four  three
0  1.723214  0.036265 -0.223240  0.253834   NaN    NaN
1  0.013932  1.429481  0.654138 -1.471901   NaN    NaN
2  0.118656 -1.155233  0.091064  1.604110   NaN    NaN
3       NaN       NaN       NaN       NaN   6.0    5.0
4       NaN       NaN       NaN       NaN   8.0    7.0

- 联合重叠数据

In [87]:
a = pd.Series([np.nan,2.5,0.0,3.5,4.5,np.nan],
             index=['f','e','d','c','b','a'])

In [88]:
b = pd.Series([0.,np.nan,2.,np.nan,np.nan,5.],
             index=['a','b','c','d','e','f'])

In [89]:
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [90]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [91]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [92]:
b.combine_first(a)

a    0.0
b    4.5
c    2.0
d    0.0
e    2.5
f    5.0
dtype: float64

## 重塑和透视

- 使用多层索引进行重塑

In [93]:
data = pd.DataFrame(np.arange(6).reshape((2,3)),
                   index = pd.Index(['ohio','colorado'],name='state'),
                   columns=pd.Index(['one','two','three'],name='number'))

In [94]:
data

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [95]:
result = data.stack()

In [96]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [97]:
result.unstack()

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [98]:
result.unstack(0)

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [99]:
result.unstack('state')

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [100]:
s1 = pd.Series([0,1,2,3],index=['a','b','c','d'])

In [101]:
s2 = pd.Series([4,5,6],index=['c','d','e'])

In [102]:
data2 = pd.concat([s1,s2],keys=['one','two'])

In [103]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [104]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [105]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [107]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [109]:
df = pd.DataFrame({'left':result,'right':result+5},
                 columns=pd.Index(['left','right'],name='side'))

In [110]:
df

side             left  right
state    number
ohio     one        0      5
         two        1      6
         three      2      7
colorado one        3      8
         two        4      9
         three      5     10

In [111]:
df.unstack('state')

side   left          right
state  ohio colorado  ohio colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [112]:
df.unstack('state').stack('side')

state         colorado  ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

-  将“宽”透视为“长”

In [113]:
df = pd.DataFrame({'key':['foo','bar','baz'],
                  'A':[1,2,3],
                  'B':[4,5,6],
                  'C':[7,8,9]})

In [114]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [116]:
melted = pd.melt(df,['key'])

In [117]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [118]:
reshape = melted.pivot('key','variable','value')

In [119]:
reshape

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [120]:
reshape.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [121]:
pd.melt(df,id_vars=['key'],value_vars=['A','B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [122]:
pd.melt(df,value_vars=['A','B','C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [123]:
pd.melt(df,value_vars=['key','A','B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6